[Killed] LogicalOperator
modules/task/internal/TaskQueries.ts:445:19
             SELECT 
                 ${param.projectId}::uuid, 
                 ${param.title}, 
-                ${param.description ?? ''}, 
+                ${param.description && ''}, 
                 ${param.status ?? 'TODO'}, 
                 ${param.actorId}, 
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:27:46.486Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:27:46.507Z - Initializing event bus ProjectServiceImpl

[Killed] StringLiteral
modules/task/internal/TaskQueries.ts:445:40
             SELECT 
                 ${param.projectId}::uuid, 
                 ${param.title}, 
-                ${param.description ?? ''}, 
+                ${param.description ?? "Stryker was here!"}, 
                 ${param.status ?? 'TODO'}, 
                 ${param.actorId}, 
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:27:51.547Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:27:51.569Z - Initializing event bus ProjectServiceImpl

[Killed] LogicalOperator
modules/task/internal/TaskQueries.ts:446:19
                 ${param.projectId}::uuid, 
                 ${param.title}, 
                 ${param.description ?? ''}, 
-                ${param.status ?? 'TODO'}, 
+                ${param.status && 'TODO'}, 
                 ${param.actorId}, 
                 ${param.actorId}
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:27:52.132Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:27:52.156Z - Initializing event bus ProjectServiceImpl

[Killed] StringLiteral
modules/task/internal/TaskQueries.ts:446:35
                 ${param.projectId}::uuid, 
                 ${param.title}, 
                 ${param.description ?? ''}, 
-                ${param.status ?? 'TODO'}, 
+                ${param.status ?? ""}, 
                 ${param.actorId}, 
                 ${param.actorId}
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:27:57.513Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:27:57.546Z - Initializing event bus ProjectServiceImpl

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:491:9
     `.execute(db);
 
     const task = result.rows[0];
-    if (!task) {
+    if (false) {
         throw new NotFoundError(
             `Project with ID ${param.projectId} not found or you do not have permission to create tasks in it.`,
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:00.266Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:00.290Z - Initializing event bus ProjectServiceImpl

[Killed] BooleanLiteral
modules/task/internal/TaskQueries.ts:491:9
     `.execute(db);
 
     const task = result.rows[0];
-    if (!task) {
+    if (task) {
         throw new NotFoundError(
             `Project with ID ${param.projectId} not found or you do not have permission to create tasks in it.`,
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:27:57.801Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:27:57.822Z - Initializing event bus ProjectServiceImpl

[Killed] EqualityOperator
modules/task/internal/TaskQueries.ts:513:9
 }): Promise<Task> => {
     // 1. Build dynamic SET fragments
     const updates: any[] = [];
-    if (param.title !== undefined) updates.push(sql`title = ${param.title}`);
+    if (param.title === undefined) updates.push(sql`title = ${param.title}`);
     if (param.description !== undefined)
         updates.push(sql`description = ${param.description ?? ''}`);
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:08.716Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:08.741Z - Initializing event bus ProjectServiceImpl

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:513:9
 }): Promise<Task> => {
     // 1. Build dynamic SET fragments
     const updates: any[] = [];
-    if (param.title !== undefined) updates.push(sql`title = ${param.title}`);
+    if (false) updates.push(sql`title = ${param.title}`);
     if (param.description !== undefined)
         updates.push(sql`description = ${param.description ?? ''}`);
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:07.158Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:07.180Z - Initializing event bus ProjectServiceImpl

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:514:9
     // 1. Build dynamic SET fragments
     const updates: any[] = [];
     if (param.title !== undefined) updates.push(sql`title = ${param.title}`);
-    if (param.description !== undefined)
+    if (false)
         updates.push(sql`description = ${param.description ?? ''}`);
     if (param.status !== undefined)
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:11.846Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:11.868Z - Initializing event bus ProjectServiceImpl

[Killed] EqualityOperator
modules/task/internal/TaskQueries.ts:514:9
     // 1. Build dynamic SET fragments
     const updates: any[] = [];
     if (param.title !== undefined) updates.push(sql`title = ${param.title}`);
-    if (param.description !== undefined)
+    if (param.description === undefined)
         updates.push(sql`description = ${param.description ?? ''}`);
     if (param.status !== undefined)
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:13.226Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:13.251Z - Initializing event bus ProjectServiceImpl

[Killed] LogicalOperator
modules/task/internal/TaskQueries.ts:515:42
     const updates: any[] = [];
     if (param.title !== undefined) updates.push(sql`title = ${param.title}`);
     if (param.description !== undefined)
-        updates.push(sql`description = ${param.description ?? ''}`);
+        updates.push(sql`description = ${param.description && ''}`);
     if (param.status !== undefined)
         updates.push(sql`status = ${param.status ?? 'TODO'}`);
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:14.522Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:14.549Z - Initializing event bus ProjectServiceImpl

[Killed] StringLiteral
modules/task/internal/TaskQueries.ts:515:63
     const updates: any[] = [];
     if (param.title !== undefined) updates.push(sql`title = ${param.title}`);
     if (param.description !== undefined)
-        updates.push(sql`description = ${param.description ?? ''}`);
+        updates.push(sql`description = ${param.description ?? "Stryker was here!"}`);
     if (param.status !== undefined)
         updates.push(sql`status = ${param.status ?? 'TODO'}`);
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:15.800Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:15.824Z - Initializing event bus ProjectServiceImpl

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:516:9
     if (param.title !== undefined) updates.push(sql`title = ${param.title}`);
     if (param.description !== undefined)
         updates.push(sql`description = ${param.description ?? ''}`);
-    if (param.status !== undefined)
+    if (false)
         updates.push(sql`status = ${param.status ?? 'TODO'}`);
 
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:17.177Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:17.200Z - Initializing event bus ProjectServiceImpl

[Killed] EqualityOperator
modules/task/internal/TaskQueries.ts:516:9
     if (param.title !== undefined) updates.push(sql`title = ${param.title}`);
     if (param.description !== undefined)
         updates.push(sql`description = ${param.description ?? ''}`);
-    if (param.status !== undefined)
+    if (param.status === undefined)
         updates.push(sql`status = ${param.status ?? 'TODO'}`);
 
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:17.182Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:17.210Z - Initializing event bus ProjectServiceImpl

[Killed] LogicalOperator
modules/task/internal/TaskQueries.ts:517:37
     if (param.description !== undefined)
         updates.push(sql`description = ${param.description ?? ''}`);
     if (param.status !== undefined)
-        updates.push(sql`status = ${param.status ?? 'TODO'}`);
+        updates.push(sql`status = ${param.status && 'TODO'}`);
 
     // Assignment updates
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:19.459Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:19.480Z - Initializing event bus ProjectServiceImpl

[Survived] StringLiteral
modules/task/internal/TaskQueries.ts:517:53
     if (param.description !== undefined)
         updates.push(sql`description = ${param.description ?? ''}`);
     if (param.status !== undefined)
-        updates.push(sql`status = ${param.status ?? 'TODO'}`);
+        updates.push(sql`status = ${param.status ?? ""}`);
 
     // Assignment updates

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:520:9
         updates.push(sql`status = ${param.status ?? 'TODO'}`);
 
     // Assignment updates
-    if (param.teamId !== undefined)
+    if (true)
         updates.push(sql`fk_team_id = ${param.teamId}::uuid`);
     if (param.memberId !== undefined)
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:22.198Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:22.220Z - Initializing event bus ProjectServiceImpl

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:520:9
         updates.push(sql`status = ${param.status ?? 'TODO'}`);
 
     // Assignment updates
-    if (param.teamId !== undefined)
+    if (false)
         updates.push(sql`fk_team_id = ${param.teamId}::uuid`);
     if (param.memberId !== undefined)
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:23.122Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:23.145Z - Initializing event bus ProjectServiceImpl

[Killed] EqualityOperator
modules/task/internal/TaskQueries.ts:522:9
     // Assignment updates
     if (param.teamId !== undefined)
         updates.push(sql`fk_team_id = ${param.teamId}::uuid`);
-    if (param.memberId !== undefined)
+    if (param.memberId === undefined)
         updates.push(sql`fk_member_id = ${param.memberId}::text`);
 
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:29.402Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:29.424Z - Initializing event bus ProjectServiceImpl

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:522:9
     // Assignment updates
     if (param.teamId !== undefined)
         updates.push(sql`fk_team_id = ${param.teamId}::uuid`);
-    if (param.memberId !== undefined)
+    if (true)
         updates.push(sql`fk_member_id = ${param.memberId}::text`);
 
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:27.163Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:27.185Z - Initializing event bus ProjectServiceImpl

[Survived] ConditionalExpression
modules/task/internal/TaskQueries.ts:525:9
     if (param.memberId !== undefined)
         updates.push(sql`fk_member_id = ${param.memberId}::text`);
 
-    if (updates.length === 0) {
+    if (false) {
         // No updates, just fetch and return current state (or maybe we should require version check anyway?)
         // To be safe and check optimistic lock, we'll still run a dummy update or just fetch.

[Timeout] ConditionalExpression
modules/task/internal/TaskQueries.ts:525:9
     if (param.memberId !== undefined)
         updates.push(sql`fk_member_id = ${param.memberId}::text`);
 
-    if (updates.length === 0) {
+    if (true) {
         // No updates, just fetch and return current state (or maybe we should require version check anyway?)
         // To be safe and check optimistic lock, we'll still run a dummy update or just fetch.

[Killed] StringLiteral
modules/task/internal/TaskQueries.ts:532:21
     }
 
     updates.push(sql`version = version + 1`);
-    updates.push(sql`updated_by = ${param.actorId}`);
+    updates.push(sql``);
     updates.push(sql`updated_at = NOW()`);
 
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:37.485Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:37.544Z - Initializing event bus ProjectServiceImpl

[Killed] StringLiteral
modules/task/internal/TaskQueries.ts:535:44
     updates.push(sql`updated_by = ${param.actorId}`);
     updates.push(sql`updated_at = NOW()`);
 
-    const setClause = sql.join(updates, sql`, `);
+    const setClause = sql.join(updates, sql``);
 
     const result = await sql<Task>`
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:39.421Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:39.442Z - Initializing event bus ProjectServiceImpl

[Killed] EqualityOperator
modules/task/internal/TaskQueries.ts:632:13
             SELECT id, version FROM project_task WHERE id = ${param.taskId}::uuid AND fk_project_id = ${param.projectId}::uuid
         `.execute(db);
 
-        if (exists.rows.length === 0) {
+        if (exists.rows.length !== 0) {
             throw new NotFoundError(
                 `Task with ID ${param.taskId} not found in project ${param.projectId}.`,
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:50.680Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:50.702Z - Initializing event bus ProjectServiceImpl

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:632:13
             SELECT id, version FROM project_task WHERE id = ${param.taskId}::uuid AND fk_project_id = ${param.projectId}::uuid
         `.execute(db);
 
-        if (exists.rows.length === 0) {
+        if (true) {
             throw new NotFoundError(
                 `Task with ID ${param.taskId} not found in project ${param.projectId}.`,
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:48.815Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:48.850Z - Initializing event bus ProjectServiceImpl

[Killed] BooleanLiteral
modules/task/internal/TaskQueries.ts:639:13
         }
 
         const currentTask = exists.rows[0];
-        if (!currentTask) {
+        if (currentTask) {
             throw new NotFoundError(
                 `Task with ID ${param.taskId} not found in project ${param.projectId}.`,
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:54.675Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:54.698Z - Initializing event bus ProjectServiceImpl

[Killed] ConditionalExpression
modules/task/internal/TaskQueries.ts:639:13
         }
 
         const currentTask = exists.rows[0];
-        if (!currentTask) {
+        if (true) {
             throw new NotFoundError(
                 `Task with ID ${param.taskId} not found in project ${param.projectId}.`,
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:28:54.687Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:28:54.710Z - Initializing event bus ProjectServiceImpl

[Killed] EqualityOperator
modules/task/internal/TaskQueries.ts:644:13
                 `Task with ID ${param.taskId} not found in project ${param.projectId}.`,
             );
         }
-        if (currentTask.version !== param.version) {
+        if (currentTask.version === param.version) {
             throw new ConflictError(
                 `Task version mismatch. Expected ${param.version}, but current version is ${currentTask.version}.`,
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:29:01.558Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:29:01.592Z - Initializing event bus ProjectServiceImpl

[Killed] BlockStatement
modules/task/internal/TaskQueries.ts:644:52
                 `Task with ID ${param.taskId} not found in project ${param.projectId}.`,
             );
         }
-        if (currentTask.version !== param.version) {
-            throw new ConflictError(
-                `Task version mismatch. Expected ${param.version}, but current version is ${currentTask.version}.`,
-            );
-        }
+        if (currentTask.version !== param.version) {}
 
         // If it still failed, it's likely validation or auth
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:29:01.872Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:29:01.895Z - Initializing event bus ProjectServiceImpl

[Killed] StringLiteral
modules/task/internal/TaskQueries.ts:646:17
         }
         if (currentTask.version !== param.version) {
             throw new ConflictError(
-                `Task version mismatch. Expected ${param.version}, but current version is ${currentTask.version}.`,
+                ``,
             );
         }
killedBy: All tests
statusReason: bun test v1.3.5 (1e86cebd)


src/tests/e2e/task/task.create.test.ts:

[INFO] 2026-04-24T14:29:03.250Z - Database: Kysely instance initialized

[INFO] 2026-04-24T14:29:03.271Z - Initializing event bus ProjectServiceImpl
